#+TITLE: Analysis strategy for WA data

* Sample dates

#+BEGIN_SRC bash

cat ncov-wa.fasta | grep '^>' | cut -d\| -f2 > dates.txt
wc -l dates.txt

#+END_SRC

#+RESULTS:
: 294 dates.txt

#+BEGIN_SRC R :session
library(lubridate)

dates <- ymd(read.table("dates.txt", header=F)[[1]])
length(dates)

#+END_SRC

#+RESULTS:
: 294

* Becoming uninfectious rate
  
We use a becoming uninfectious period of 12 days, thus a bu rate of
#+BEGIN_SRC R :session
365/12
#+END_SRC

#+RESULTS:
: 30.4166666666667

* Priors

Origin should be earlier than first sample:
#+BEGIN_SRC R :session
(max(dates)-min(dates))/365.25
#+END_SRC

#+RESULTS:
: 0.0657084188911704

A log normal prior with M=-2 and S=0.8 gives 95% quantile dates of
#+BEGIN_SRC R :session
max(dates) - qlnorm(c(0.025,0.975), -2, 0.8)*365
#+END_SRC

#+RESULTS:
| 2020-03-04 |
| 2019-07-22 |

These seem, if anything, too cautious.
